# 如何科学的思考

功能介绍企业进化加速器，智能商业推动者。助力成长型企业家升级商业思想操作系统，
打造持续经营的指数型组织。

# 和君同行阅读思考

1、学会问问题很不容易，文中提到2/3以上的提问者自己都没想清楚自己最终想知道什么
。我们得不到答案往往是因为没有问正确的问题。如果你仔细体会你老板的问题，就会发
现，老板一般直击要点，都是重点。

2、一个马上能用到思考方法：<以果为始>。以最终的结果作为思考的开始，以最初需要的数
据或者信息为这个循环思维的终点。


# 正文/杜牛牛

独立思考者的思考模型系列1–如何科学的思考，来自杜牛牛透过数字看世界，用数据和思
考，撕裂生活的内衣。

微软前总裁高群耀说过一句话让我印象深刻，大意是我们努力了那么多年，取得了不小的
成就，我相信我们一定做对了一些事情。我觉得能够做对事情的一个重要前提是，我们想
对了一些事情，而要想对事情就需要掌握一些正确的思考方法。

巴菲特和芒格一定不是靠掷筛子下注的，他们比一些人更接近真相的最重要原因是因为他
们掌握了更正确的思维方式。

我个人将思考问题分成7个步骤。

1. 正确的定义问题 Define Question

我们的身体常常不太聪明，表面现象常常另有所指。牙齿脱落可能是肾虚；而头发疼可能
是脑子出了毛病。同样的，我们的大脑常常不聪明，大脑提出的问题未必是真正需要解决
的问题。

一个打算跳槽的做人力资源的学妹曾经问我，“我投的一家大公司即将给我offer了，可是
现在所在民营企业的老板答应给我加薪升职，我还该不该跳槽呢？”

我问她“为什么要跳槽呢？”

“想去外资企业。”

“为什么想去外资企业呢？”

“外企规模大，也更加正规。”

“为什么要去规模大的企业呢？”

“因为规模大的企业有一套完善的流程。”

“有完善流程的企业对你有什么帮助呢？”

“能够让我学到更加完整的人力资源体系。”

“学到这个对你意味着什么？”

“这是我职业发展的方向和向上突破的重要基础。”

“好，那么现在的企业即使给你升职，是否能让你学到完整的体系呢？”

“不能，我明白了。”

这个时候学妹头势和思路就非常清楚了。其实，在这个过程中我只是帮她纠正了定义问题
的方法。她的问题不该是一开始问的“该不该跳槽”，而应该是“哪个公司能给我我要的学到
完整人力资源体系的机会”。

我曾经留意过一天中被问到的问题。我发现，2/3以上的提问者自己都没想清楚自己最终想
知道什么。我们得不到答案往往是因为没有问正确的问题。

2. 建立逻辑树 Set up Logical（Decision）Tree

巴菲特最好的合作伙伴查理.芒格曾经形容过巴菲特的思维方式的优点，其中一点就是巴菲
特及其善于运用逻辑树，又叫决策树。

什么是决策树？就是由所问的问题展开的要解决这个问题需要考虑的因素（把问题作为结
果，即是会影响结果的因素）。这是我自己的定义，未必准确。

例如，我想知道为何阿凡达的票房会如此火爆，请问你该如何回答。是因为炒作？因为实
力？还是因为导演知名度？

这些答案都没有错，但是这个问题的答案可能更复杂一些，复杂到我们不能仅仅通过拍脑
袋想到或者媒体上看到的几种可能性来下定论。

我和自己做了一下头脑风暴，得到了如下逻辑树。阿凡达剧中有棵生命之树，是潘朵拉星
球生命的根源，万物由它而生。把我们的问题当作生命之树，衍生出的各种可能性和影响
因素通过层层剥离的方法列出，就形成了逻辑树。此处我只粗略列了2个1级目录，4个2级
目录以及16个细分原因，如果认真思索，一定能想到更多。

3. 奥多姆剃刀 Dirty Filter

你一定也发现了，逻辑树中有几处原因有明显的问题。例如，内部因素—》人的因素—》演
员。

不清楚导演的用意何在，这部片子的演员基本都不是大牌，可能是为了节约片酬成本（反
正看不清脸），也可能是个人习惯（当年的《泰坦尼克号》启用的也不是当时的大牌）。
因此，由于演员吸引了观众而促使《阿凡达》火爆的说法显然站不住脚。我们可以直接将
他从逻辑树中删除。

奥多姆剃刀的原意已经很难考（我已经看到众多版本，这也不是本章的目的），我的解释
是为确保高效简洁和操作性，保留核心，大胆删除不相关部分或者相关度低的部分。

4. 提出假设 Build Hypothesis

到了最关键的一步了。

大多数人的思维方式是<正向思维>（这也是人类大脑“原装”的思维方式），即演绎的思维。
要回答阿凡达为何火爆的问题，我们可以收集海量的各种数据，动用大量的人力物力精力
，综合分析，最后计算出无数种可能性，最后从庞杂的数据库中寻找相关联系，最后找出
问题的答案。

然而我们往往没有这样无限的资源，即使有，我们是否存在更好的方法呢？

<逻辑学家提出了归纳的方式，这种思考方式在数学家手中发展出了递归的思维方法>。当
运用到科学领域的时候，科学家总结出了一种有效的思维模型：<假设-检验>。

也就是说，在我用海量数据进行分析之前，先进行假设。例如，我根据自己的常识，感觉
以及少量的数据，进行判断，提出一个假设，“《阿凡达》的火爆票房是因为经济大萧条引
起的”。这个假设不是空穴来风，确有许多经济学家发现一个隐藏的违背常识的规律：当经
济萧条的时候，就是娱乐产业爆发的阶段。好，既然这个假设是有可能成立的，我们接下
来就要找到相应的数据，来支持，或者推翻我们的假设。

5. 确定数据 Define Data

我现在就要找到数据来检验我的假设，“《阿凡达》的火爆票房是因为经济大萧条引起的”
。那么我需要哪些数据呢？

如果我以美国为例，如果假设成立，那么美国经济的发展趋势是否和娱乐产业相悖？美国
有几次经济萧条？萧条期娱乐产业发展速度如何？那么非萧条期娱乐产业发展又如何？（
在证明一件事情是什么的时候必须同时证明他不是什么）娱乐产业，尤其是电影产业有哪
几个爆发的阶段？这些阶段GDP的发展如何？在欧洲，日本，中国等国家和地区是否有同样
趋势？

此外，如果我们想把问题解决的更加严密，还需要考虑这样几个问题：《阿凡达》多大程
度能够代表电影产业和娱乐产业？（毕竟娱乐产业再好的时候毁掉的电影也不在少数）电
影产业的火爆是因为经济萧条引起的？还是仅仅同时发生但并无因果关系？如果有因果关
系，产业链又是如何从经济引导到一部具体的电影的？这些问题，有需要哪些数据来支持
？

回答完这些问题，我们就确定了收集数据的方向。

6. 写出数据来源 List Data Source

我们已经明确了需要哪些来源，好比我们已经为晚上的Party开好了菜单，那么现在我们就
要规划好去哪里买菜了。是去大卖场，还是超市，菜场，还是便利店。不同的产品需要从
不同的渠道采购，数据也是一样。

7. 收集数据 Collect Data

开始着手收集需要的信息，并在这个过程中不断调整计划。

好，到这里为止，我们完成了一个<思维循环>。我们在处理任何的问题时，一种有效的方法
就是以果为始。以最终的结果作为思考的开始，以最初需要的数据或者信息为这个循环思
维的终点。在思考一个重要问题，或者做出重要结论前，先确定真正的问题，思索一下所
有的相关因素，进行清理。然后针对重点提出假设，并明确支持或者推翻假设需要的数据
，然后明确目的地，收集数据。这样的思考方式，能帮助我们变得更高效，科学和强大。 

明白了如何思考只是一个开始。收集到数据后，我们需要运用更多的思维模型来辨别，分
析，处理和预测信息。 


