# 201_经济学通识

# 世上没有免费的午餐

而世界上最无耻的一个词语是：免费。

当资本免费就没有人投资。
这个道理连各国央行的头头脑脑都不懂，或假装不懂，脑袋进水。所以，各国央行才会想起负利率的损招。
想到这里，我就有点原谅你们这些持剩余价值和剥削理论的贼们。他们是大贼，你们只是小偷而已。

企业家精神是一种承担风险的能力，这种能力和勇气是少数人具备的。
当一个社会变成强盗思维时，没有人会出来做企业家。

# 关注<看不见>的事物

一个人的钱是有限的，花在旅游方面多了，是不是就会少买书，少买衣服了呢？
这些_看不见_的行业岂不就萎缩了？因此这些刺激经济的措施对整个经济的影响是不确定的。

有个故事说道：一个杯子，是空的话，可以注入满杯水，有半杯水的话，可以再注入半杯水，但如果是满杯，就一滴也注入不进去了。
故事告诉我们人要虚怀若谷，要认真思考他人的一些观点和思想，哪怕和自己并不一致。圣人尚且说自己一无所知，读者诸君不妨便如圣人般虚心无成见地阅读该书，
当别有一番滋味，多一点收获。如果不再迷信<免费午餐>，而且也能关注到<看不见>的事物，那恭喜您，您已经是少有的掌握了经济学精髓的人了！

看不见的范畴<守恒：当下商业在于对人类整体之金钱、时间、注意力的争夺，无它>
. 时间上 操作频繁，耐心一支股票一字板放量后，<经过3天>调整，再冲突放量(2016-03-24.东风科技)
. 空间上 靠得太近，你会只见树木，不见森林
. 观念上 虚怀若谷，or你会选择性，视而不见

# 人类至少面临四项普遍约束

[](http://blog.caijing.com.cn/expert_article-151273-85127.shtml)

   四项普遍约束：   四套经济理论

1      东西不够；   需求定律；
2      生命有限；   利息理论；
3      互相依赖；   制度理论；
4      需要协调。   宏观理论。

# 金钱的价格

金钱的价格不是利息，而是购买力。
换言之，一块美金能买一瓶汽水，那么一块美金的价格就是一瓶汽水。用金钱来买汽水，也同样可以看作是用汽水来买金钱。买家和卖家地位相同，需求与供给没有根本区别，这才是扎实的价格分析框架。

# 利息

利息是人类社会最古老的现象之一。它起源于人的不耐，不依赖于货币的存在。
有趣的问题是：在没有货币的社会，或在禁止收取利息的社会，如何观察利率的变化？
答案是：观察<耐用品与易耗品比价>的变化。如果草寮相对瓦房升值，则利率上升；反之则利率下降。          <替代性 A+B供应面积不恒定>

同样的道理，假如牛奶相对干酪升值，则说明利率下降。
因为干酪是未来商品，所以只有当利率下降时，干酪才会相对升值；
而当人们把更多用于即时消费的牛奶用来生产未来才制成的干酪时，牛奶相对减少了，其价格也就相对上升了。  <转换性 A+B供应热量恒定>
那葡萄相对葡萄酒相对升值呢？读者可以照样画葫芦了。

# 利息.我之理解

  短期利息一定贵吗？

  相同的10钱，1别墅=3草房=1钱，最多得30草房 = 10别墅

  供应-  需求0
  供应-  需求-
  供应-  需求+

  供应0  需求0
  供应0  需求-
  供应0  需求+

  供应+  需求0
  供应+  需求-
  供应+  需求+

[薛兆丰：向费雪致敬.利息理论](http://book.douban.com/review/1960099/)

